<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
'type'  =>  '\think\oracle\Connection',
'hostname' => '192.9.230.22', //数据库地址
'database' => 'orcl', //数据库SID
'username' => 'WTQ', // 用户名
'password' => '123456', // 密码
'hostport' => '1521', //端口号
'charset'=> 'utf8', // 数据库编码
];
